ReadMe.md
```mermaid
graph TD;

	package_name --> requirement;
	specifier --> requirement;
	marker --> requirement;
	direct_url --> requirement;

	requirement --> distribution_metadata;
	version --> specifier;

	package_name --> pep621;
	version --> pep621;
	entry_points --> pep621;
	pep621 --> sdist;
	sdist --> wheel;
	wheel_metadata --> wheel;


	wheel_tag --> wheel_filename;
	package_name --> wheel_filename;
	version --> wheel_filename;
	wheel_filename --> wheel;

	package_name --> sdist_filename;
	version --> sdist_filename;

	marker --> wheel_tag;

	wheel_tag --> wheel_metadata;
	pep621 --> wheel_metadata;

	distribution --> installation;

	package_name --> distribution_metadata;
	version --> distribution_metadata;

	distribution_metadata --> dist-info;
	distribution_record --> dist-info;
	entry_points --> dist-info;
	wheel_metadata --> dist-info;
	direct_url --> dist-info;

	dist-info --> distribution;
	resource --> distribution;
	module_path --> distribution;

	distribution --> wheel;
	package_name --> module_path;
	module_path --> entry_points;
	sdist_manifest --> sdist;
	sdist --> sdist_archive;
	sdist_filename --> sdist_archive;

	sdist --> index;
	wheel --> index;
	entry_points --> script;

	requirement --> locator;
	locator --> index;
```
